module.exports.config = {
  name: 'auto',
  version: '10.02',
  hasPermssion: 0,
  credits: 'DC-Nam',
  description: 'Tự động gửi tin nhắn theo giờ đã cài!',
  commandCategory: 'admin',
  usages: '[]',
  cooldowns: 3
};
const nam = [{
  timer: '11:00:00 PM',
  message: ['𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐧𝐠𝐮̉ 𝐧𝐠𝐨𝐧😴', '𝐊𝐡𝐮𝐲𝐚 𝐫𝐮̀𝐢 𝐧𝐠𝐮̉ 𝐧𝐠𝐨𝐧 𝐧𝐡𝐞́ 𝐜𝐚́𝐜 𝐛𝐚̣𝐧😇 \n ❤️𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵 :𝓝𝓮̂́𝓾 𝓶𝓸̂̃𝓲 𝓵𝓪̂̀𝓷 𝓷𝓱𝓸̛́ 𝓪𝓷𝓱 𝓮𝓶 𝓭𝓾̛𝓸̛̣𝓬 500 𝓭𝓸̂̀𝓷𝓰. 𝓒𝓱𝓪̆́𝓬 𝓬𝓱𝓪̆́𝓷 𝓰𝓲𝓸̛̀ 𝓷𝓪̀𝔂 𝓮𝓶 𝓭𝓪̃ 𝓽𝓱𝓪̀𝓷𝓱 “𝓽𝓲̉ 𝓹𝓱𝓾́”']
},
{ 
  timer: '12:35:00 PM',
  message: ['➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀:𝟏𝟐𝒉𝟑𝟓𝒑 \n🧸 𝗧𝗿𝘂̛𝗮 𝗿𝗼̂̀𝗶 𝗻𝗴𝘂̉ đ𝗶 𝗯𝗮̂́𝗺 𝗹𝗮̆́𝗺\n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:𝑨𝒏𝒉 𝒏𝒉𝒖̛ 𝒒𝒖𝒂̉ 𝒕𝒓𝒖̛́𝒏𝒈 𝟐 𝒍𝒐̀𝒏𝒈. 𝑴𝒐̣̂𝒕 𝒍𝒐̀𝒏𝒈 𝒚𝒆̂𝒖 𝒏𝒖̛𝒐̛́𝒄 𝒎𝒐̣̂𝒕 𝒍𝒐̀𝒏𝒈 𝒚𝒆̂𝒖 𝒆𝒎.\n━━━━━━━━━━━━━━━━━━\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
},
{
  timer: '1:00:00 PM',
  message: ['𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮𝐨̂̉𝐢 𝐜𝐡𝐢𝐞̂̀𝐮 𝐯𝐮𝐢 𝐯𝐞̉🙌', '𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮𝐨̂̉𝐢 𝐜𝐡𝐢𝐞̂̀𝐮 đ𝐚̂̀𝐲 𝐧𝐚̆𝐧𝐠 𝐥𝐮̛𝐨̛̣𝐧𝐠😼']
},
{
  timer: '6:00:00 AM',
  message: ['𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮𝐨̂̉𝐢 𝐬𝐚́𝐧𝐠 𝐯𝐮𝐢 𝐯𝐞̉😉', '𝐁𝐮𝐨̂̉𝐢 𝐬𝐚́𝐧𝐠 đ𝐚̂̀𝐲 𝐧𝐚̆𝐧𝐠 𝐥𝐮̛𝐨̛̣𝐧𝐠 𝐧𝐡𝐚𝐚 𝐜𝐚́𝐜 𝐛𝐚̣𝐧😙', '𝐂𝐡𝐮́𝐜 𝐦𝐧 𝐛𝐮𝐨̂̉𝐢 𝐬𝐚́𝐧𝐠 𝐯𝐮𝐢 𝐯𝐞̉ ❤️']
},
{
  timer: '12:00:00 PM',
  message: ['𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮𝐨̂̉𝐢 𝐭𝐫𝐮̛𝐚 𝐯𝐮𝐢 𝐯𝐞̉😋', '𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮̛̃𝐚 𝐭𝐫𝐮̛𝐚 𝐧𝐠𝐨𝐧 𝐦𝐢𝐞̣̂𝐧𝐠😋']
},
{
  timer: '11:35:00 AM',
  message: ['➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀:𝟏𝟏𝒉𝟐𝟓𝒑 \n🧸 𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗻𝗴𝘂̉ 𝗻𝗴𝗼𝗻 \n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:𝗕𝗮𝗼 𝗻𝗵𝗶𝗲̂𝘂 𝗰𝗮̂𝗻 𝘁𝗵𝗶́𝗻𝗵 𝗰𝗵𝗼 𝘃𝘂̛̀𝗮. 𝗕𝗮𝗼 𝗻𝗵𝗶𝗲̂𝘂 𝗰𝗮̂𝗻 𝗯𝗮̉ 𝗺𝗼̛́𝗶 𝗹𝘂̛̀𝗮 𝗱𝘂̛𝗼̛̣𝗰 𝗮𝗻𝗵.\n━━━━━━━━━━━━━━━━━━\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
},           
{
  timer: '11:00:00 AM',
  message: ['━━━━━━━━━━━━━━━━━━\n💸 ==== [ 𝗧𝗛𝗨𝗘̂ 𝗕𝗢𝗧 ] ==== 💸\n[🌷] ➜ 𝗧𝗵𝘂𝗲̂ 𝗕𝗼𝘁 20𝗸/𝘁𝗵\n[⚜️] ➜ Đ𝘂̛𝗼̛̣𝗰 𝘁𝗮𝗴 𝘁𝗮̂́𝘁 𝗰𝗮̉ 𝗯𝗼𝘅 𝗸𝗲̂̉ 𝗰𝗮̉ 𝗱𝘂̛𝗼̛́𝗶 𝟭5 𝗻𝗴𝘂̛𝗼̛̀𝗶\n[⚜️] ➜ 𝗗𝘂̀𝗻𝗴 đ𝘂̛𝗼̛̣𝗰 𝗺𝗼̣̂𝘁 𝘀𝗼̂́ 𝗹𝗲̣̂𝗻𝗵 𝗔𝗱𝗺𝗶𝗻\n━━━━━━━━━━━━━━━━━━\n🌸 ==== [ 𝗙𝗕 𝗔𝗗𝗠𝗜𝗡 ] ==== ❤️\n[💌] ➜ https://www.facebook.com/profile.php?id=61553737733038\n[❤️]\n━━━━━━━━━━━━━━━━━━\n[🌷] ➜ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
},               
{
  timer: '10:00:00 AM',
  message: ['𝐍𝐚̂́𝐮 𝐜𝐨̛𝐦 𝐧𝐡𝐨̛́ 𝐛𝐚̣̂𝐭 𝐧𝐮́𝐭 𝐧𝐡𝐚 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 😙']
},          
{  
  timer: '12:30:00 AM',
  message: ['➝ 𝗕𝗮̂𝘆 𝗚𝗶𝗼̛̀ 𝗟𝗮̀:𝟏𝟐𝒉𝟑𝟎𝒑 \n🧸 𝗖𝗵𝘂́𝗰 𝗺𝗼̣𝗶 𝗻𝗴𝘂̛𝗼̛̀𝗶 𝗻𝗴𝘂̉ 𝗻𝗴𝗼𝗻 \n💬 𝗖𝗮̂𝘂 𝘁𝗵𝗶́𝗻𝗵:𝑩𝒐̂̀ 𝒄𝒐̂𝒏𝒈 𝒂𝒏𝒉 𝒃𝒂𝒚 𝒌𝒉𝒊 𝒄𝒐́ 𝒈𝒊𝒐́. 𝑬𝒎 𝒄𝒉𝒊̉ 𝒄𝒖̛𝒐̛̀𝒊 𝒗𝒊̀ 𝒐̛̉ 𝒅𝒐́ 𝒄𝒐́ 𝒂𝒏𝒉.\n━━━━━━━━━━━━━━━━━━\n➝ Đ𝗮̂𝘆 𝗹𝗮̀ 𝘁𝗶𝗻 𝗻𝗵𝗮̆́𝗻 𝘁𝘂̛̣ đ𝗼̣̂𝗻𝗴']
},           
 {
  timer: '5:00:00 PM',
  message: ['𝐂𝐡𝐮́𝐜 𝐦𝐨̣𝐢 𝐧𝐠𝐮̛𝐨̛̀𝐢 𝐛𝐮𝐨̂̉𝐢 𝐜𝐡𝐢𝐞̂̀𝐮 𝐭𝐚̀ 𝐯𝐮𝐢 𝐯𝐞̉🥰']
}];
module.exports.onLoad = o => setInterval(() => {
  const r = a => a[Math.floor(Math.random()*a.length)];
  if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};